tests/test_xmls/test_run_ps_in_cmd/3-request.xml

<s:Envelope xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:cert="http://schemas.microsoft.com/wbem/wsman/1/config/service/certmapping" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsmid="http://schemas.dmtf.org/wbem/wsman/identify/1/wsmanidentity.xsd" xmlns:wsmanfault="http://schemas.microsoft.com/wbem/wsman/1/wsmanfault" xmlns:i="http://schemas.microsoft.com/wbem/wsman/1/cim/interactive.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:cim="http://schemas.dmtf.org/wbem/wscim/1/common" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:sub="http://schemas.microsoft.com/wbem/wsman/1/subscription" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:plugin="http://schemas.microsoft.com/wbem/wsman/1/config/PluginConfiguration" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/machineid">
<s:Header>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
    <w:OperationTimeout>PT20S</w:OperationTimeout>
    <w:Locale xml:lang="en-US" s:mustUnderstand="false"/>
    <a:Action s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</a:Action>
    <p:SessionId s:mustUnderstand="false">uuid:11111111-1111-1111-1111-111111111111</p:SessionId>
    <p:DataLocale xml:lang="en-US" s:mustUnderstand="false"/>
    <a:To>https://windows-host:5986/wsman</a:To>
    <w:MaxEnvelopeSize>512000</w:MaxEnvelopeSize>
    <w:SelectorSet>
        <w:Selector Name="ShellId">4C7F3BB5-B508-4F20-9B6E-C8980CFCADCA</w:Selector>
    </w:SelectorSet>
    <w:OptionSet>
        <w:Option Name="WINRS_CONSOLEMODE_STDIN">TRUE</w:Option>
        <w:Option Name="WINRS_SKIP_CMD_SHELL">FALSE</w:Option>
    </w:OptionSet>
    <a:ReplyTo>
        <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:MessageID>uuid:11111111-1111-1111-1111-111111111111</a:MessageID>
</s:Header>
<s:Body>
    <rsp:CommandLine>
        <rsp:Command>powershell.exe</rsp:Command>
        <rsp:Arguments>Write-Host</rsp:Arguments>
        <rsp:Arguments>testing</rsp:Arguments>
    </rsp:CommandLine>
</s:Body>
</s:Envelope>
