resources/wsman/failed.xml

<s:Envelope
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing">
    <s:Header>
        <a:To>
            http://10.10.0.3:5985/wsman?PSVersion=7.4.10
            </a:To>
        <a:Action
            s:mustUnderstand="true">
            http://schemas.dmtf.org/wbem/wsman/1/wsman/Create
            </a:Action>
        <a:ReplyTo
            s:mustUnderstand="true">
            <a:Address>
                http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
                </a:Address>
            </a:ReplyTo>
        <a:MessageID>
            uuid:1f7d358c-9735-4c5e-9fb4-5eae9aa59faa
            </a:MessageID>
        <w:ResourceURI
            s:mustUnderstand="true">
            http://schemas.microsoft.com/powershell/Microsoft.PowerShell
            </w:ResourceURI>
        <w:MaxEnvelopeSize
            s:mustUnderstand="true">
            512000
            </w:MaxEnvelopeSize>
        <w:Locale
            xml:lang="en-US"
            s:mustUnderstand="false"/>
        <p:DataLocale
            s:mustUnderstand="false"
            xml:lang="en-CA"/>
        <p:SessionId
            s:mustUnderstand="false">
            uuid:c7602f6d-eab0-4992-a720-0dfb7bd4ebff
            </p:SessionId>
        <p:OperationID
            s:mustUnderstand="false">
            uuid:2dac7082-0bc4-4bf5-bd88-3cc7b867ad2b
            </p:OperationID>
        <p:SequenceId
            s:mustUnderstand="false">
            1
            </p:SequenceId>
        <w:OptionSet
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            s:mustUnderstand="true">
            <w:Option
                Name="protocolversion"
                w:MustComply="true">
                2.3
                </w:Option>
            </w:OptionSet>
        <w:OperationTimeout>
            PT180.000S
            </w:OperationTimeout>
        <rsp:CompressionType
            xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
            s:mustUnderstand="true">
            xpress
            </rsp:CompressionType>
        </s:Header>
    <s:Body>
        <rsp:Shell
            xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
            ShellId="95822756-3d07-42f9-8a84-8ca130e0a723"
            Name="Runspace1">
            <rsp:InputStreams>
                stdin pr
                </rsp:InputStreams>
            <rsp:OutputStreams>
                stdout
                </rsp:OutputStreams>
            <creationXml
                xmlns="http://schemas.microsoft.com/powershell">
                 […]AAAAAAAAAAEAAAAAAAAAAAMAAADHAgAAAAIAAQCVgidWPQdC+YqEjKEw4KcjAAAAAAAAAAAAAAAAAAAAADxPYmogUmVmSWQ9IjAiPjxNUz48VmVyc2lvbiBOPSJwcm90b2NvbHZlcnNpb24iPjIuMzwvVmVyc2lvbj48VmVyc2lvbiBOPSJQU1ZlcnNpb24iPjIuMDwvVmVyc2lvbj48VmVyc2lvbiBOPSJTZXJpY
                </creationXml>
            </rsp:Shell>
        </s:Body>
    </s:Envelope>
